app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    generated_password = Devise.friendly_token.first(8)
    user = User.create!(
      email: params[:user][:email],
      password: generated_password
    )